Update README for recent changes
